# PlanCircuitSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanCircuitSet Constructor
PlanCircuitSet Class See Also
---
Initializes a new instance of the PlanCircuitSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PlanCircuitSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PlanCircuitSet()
```

# See Also
PlanCircuitSet Class
Autodesk.Revit.DB Namespace